#### [`repos-official-new`] Terraform Plan 📖`success`



<details><summary>Show Plan</summary>

```tf
data.github_team.cdktn-team-cdk-terrain: Reading...
github_repository.cdktn-provider-http-go_repo_EF7D8730: Refreshing state... [id=cdktn-provider-http-go]
github_repository.cdktn-provider-dns-go_repo_3883B88C: Refreshing state... [id=cdktn-provider-dns-go]
github_repository.cdktn-provider-http_repo_5B821B5F: Refreshing state... [id=cdktn-provider-http]
github_repository.cdktn-provider-hcp-go_repo_4C9D8FDA: Refreshing state... [id=cdktn-provider-hcp-go]
github_repository.cdktn-provider-hcp_repo_8F20D8D5: Refreshing state... [id=cdktn-provider-hcp]
github_repository.cdktn-provider-dns_repo_60FE1B06: Refreshing state... [id=cdktn-provider-dns]
github_issue_label.cdktn-provider-http-go_repository-setup_no-auto-close-label_B8B23FD0: Refreshing state... [id=cdktn-provider-http-go:no-auto-close]
github_repository_webhook.cdktn-provider-http-go_repository-setup_slack-webhook_929855F1: Refreshing state... [id=591033559]
github_issue_label.cdktn-provider-http-go_repository-setup_auto-approve-label_B0479E1C: Refreshing state... [id=cdktn-provider-http-go:auto-approve]
github_issue_label.cdktn-provider-http-go_repository-setup_automerge-label_7591A00F: Refreshing state... [id=cdktn-provider-http-go:automerge]
github_branch_protection.cdktn-provider-dns_repository-setup_main-protection_5B21E0B4: Refreshing state... [id=BPR_kwDOQ3xdJs4EQ99z]
github_actions_secret.cdktn-provider-dns_repo_secret-alert-prs-slack-webhook-url_C4EC3CB5: Refreshing state... [id=cdktn-provider-dns:ALERT_PRS_SLACK_WEBHOOK_URL]
github_issue_label.cdktn-provider-dns_repository-setup_automerge-label_676A1785: Refreshing state... [id=cdktn-provider-dns:automerge]
github_repository_dependabot_security_updates.cdktn-provider-dns_dependabot-security_2BE66F99: Refreshing state... [id=cdktn-provider-dns]
github_actions_secret.cdktn-provider-dns_repo_secret-gh-app-id-alias-PROJEN_APP_ID_C5FA55A4: Refreshing state... [id=cdktn-provider-dns:PROJEN_APP_ID]
data.github_team.cdktn-team-cdk-terrain: Read complete after 2s [id=15746607]
github_actions_secret.cdktn-provider-dns_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_9EC25F2C: Refreshing state... [id=cdktn-provider-dns:GO_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-dns_repo_secret-gh-token_7730C1FC: Refreshing state... [id=cdktn-provider-dns:GH_TOKEN]
github_issue_label.cdktn-provider-dns_repository-setup_auto-approve-label_FEBBFBED: Refreshing state... [id=cdktn-provider-dns:auto-approve]
github_actions_secret.cdktn-provider-dns_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_3584BDE6: Refreshing state... [id=cdktn-provider-dns:PROJEN_APP_PRIVATE_KEY]
github_repository_webhook.cdktn-provider-dns_repository-setup_slack-webhook_900EEF0E: Refreshing state... [id=591036107]
github_issue_label.cdktn-provider-dns_repository-setup_no-auto-close-label_FCA7B78C: Refreshing state... [id=cdktn-provider-dns:no-auto-close]
github_actions_secret.cdktn-provider-dns_repo_secret-gh-app-private-key_D6AE050F: Refreshing state... [id=cdktn-provider-dns:GH_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-dns_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_E1562C5A: Refreshing state... [id=cdktn-provider-dns:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-dns_repo_secret-twine-password_993A280C: Refreshing state... [id=cdktn-provider-dns:TWINE_PASSWORD]
github_actions_secret.cdktn-provider-dns_repo_secret-npm-token_0DB44AAF: Refreshing state... [id=cdktn-provider-dns:NPM_TOKEN]
github_actions_secret.cdktn-provider-dns_repo_secret-twine-username_A225ECA9: Refreshing state... [id=cdktn-provider-dns:TWINE_USERNAME]
github_actions_secret.cdktn-provider-dns_repo_secret-gh-app-id_1792033E: Refreshing state... [id=cdktn-provider-dns:GH_APP_ID]
github_repository_webhook.cdktn-provider-hcp_repository-setup_slack-webhook_EBF302ED: Refreshing state... [id=596943376]
github_actions_secret.cdktn-provider-hcp_repo_secret-alert-prs-slack-webhook-url_CBDC2CE9: Refreshing state... [id=cdktn-provider-hcp:ALERT_PRS_SLACK_WEBHOOK_URL]
github_repository_dependabot_security_updates.cdktn-provider-hcp_dependabot-security_0A947AF5: Refreshing state... [id=cdktn-provider-hcp]
github_issue_label.cdktn-provider-hcp_repository-setup_no-auto-close-label_A0A3D64B: Refreshing state... [id=cdktn-provider-hcp:no-auto-close]
github_actions_secret.cdktn-provider-hcp_repo_secret-gh-app-id_48D8355E: Refreshing state... [id=cdktn-provider-hcp:GH_APP_ID]
github_actions_secret.cdktn-provider-hcp_repo_secret-twine-username_4610D963: Refreshing state... [id=cdktn-provider-hcp:TWINE_USERNAME]
github_actions_secret.cdktn-provider-hcp_repo_secret-npm-token_457354E1: Refreshing state... [id=cdktn-provider-hcp:NPM_TOKEN]
github_actions_secret.cdktn-provider-hcp_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_5FE18D77: Refreshing state... [id=cdktn-provider-hcp:GO_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-hcp_repo_secret-gh-app-id-alias-PROJEN_APP_ID_E2AB9F33: Refreshing state... [id=cdktn-provider-hcp:PROJEN_APP_ID]
github_branch_protection.cdktn-provider-hcp_repository-setup_main-protection_4552043C: Refreshing state... [id=BPR_kwDORTlnY84EWklt]
github_actions_secret.cdktn-provider-hcp_repo_secret-gh-token_35D43952: Refreshing state... [id=cdktn-provider-hcp:GH_TOKEN]
github_issue_label.cdktn-provider-hcp_repository-setup_automerge-label_869BE428: Refreshing state... [id=cdktn-provider-hcp:automerge]
github_actions_secret.cdktn-provider-hcp_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_09540776: Refreshing state... [id=cdktn-provider-hcp:PROJEN_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-hcp_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_F60282E5: Refreshing state... [id=cdktn-provider-hcp:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-hcp_repo_secret-twine-password_0C44EB37: Refreshing state... [id=cdktn-provider-hcp:TWINE_PASSWORD]
github_issue_label.cdktn-provider-hcp_repository-setup_auto-approve-label_25C66990: Refreshing state... [id=cdktn-provider-hcp:auto-approve]
github_actions_secret.cdktn-provider-hcp_repo_secret-gh-app-private-key_280D74C1: Refreshing state... [id=cdktn-provider-hcp:GH_APP_PRIVATE_KEY]
github_issue_label.cdktn-provider-hcp-go_repository-setup_no-auto-close-label_1767D895: Refreshing state... [id=cdktn-provider-hcp-go:no-auto-close]
github_issue_label.cdktn-provider-hcp-go_repository-setup_automerge-label_638B4D49: Refreshing state... [id=cdktn-provider-hcp-go:automerge]
github_repository_webhook.cdktn-provider-hcp-go_repository-setup_slack-webhook_CD7D7DB4: Refreshing state... [id=596943422]
github_issue_label.cdktn-provider-hcp-go_repository-setup_auto-approve-label_E7903823: Refreshing state... [id=cdktn-provider-hcp-go:auto-approve]
github_repository_dependabot_security_updates.cdktn-provider-http_dependabot-security_15C0CF03: Refreshing state... [id=cdktn-provider-http]
github_actions_secret.cdktn-provider-http_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_080A2364: Refreshing state... [id=cdktn-provider-http:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-http_repo_secret-gh-app-id_E8794717: Refreshing state... [id=cdktn-provider-http:GH_APP_ID]
github_actions_secret.cdktn-provider-http_repo_secret-twine-password_D7E445AE: Refreshing state... [id=cdktn-provider-http:TWINE_PASSWORD]
github_actions_secret.cdktn-provider-http_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_F0352969: Refreshing state... [id=cdktn-provider-http:PROJEN_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-http_repo_secret-twine-username_764E0074: Refreshing state... [id=cdktn-provider-http:TWINE_USERNAME]
github_issue_label.cdktn-provider-http_repository-setup_automerge-label_A0C5597B: Refreshing state... [id=cdktn-provider-http:automerge]
github_actions_secret.cdktn-provider-http_repo_secret-gh-app-private-key_6F6E0F82: Refreshing state... [id=cdktn-provider-http:GH_APP_PRIVATE_KEY]
github_issue_label.cdktn-provider-http_repository-setup_no-auto-close-label_0AA88912: Refreshing state... [id=cdktn-provider-http:no-auto-close]
github_actions_secret.cdktn-provider-http_repo_secret-npm-token_8061869F: Refreshing state... [id=cdktn-provider-http:NPM_TOKEN]
github_actions_secret.cdktn-provider-http_repo_secret-gh-app-id-alias-PROJEN_APP_ID_F8F3C7E3: Refreshing state... [id=cdktn-provider-http:PROJEN_APP_ID]
github_actions_secret.cdktn-provider-http_repo_secret-gh-token_B691F459: Refreshing state... [id=cdktn-provider-http:GH_TOKEN]
github_branch_protection.cdktn-provider-http_repository-setup_main-protection_62E00E3E: Refreshing state... [id=BPR_kwDOQ3wxqc4EQ96I]
github_issue_label.cdktn-provider-http_repository-setup_auto-approve-label_19956EF2: Refreshing state... [id=cdktn-provider-http:auto-approve]
github_actions_secret.cdktn-provider-http_repo_secret-alert-prs-slack-webhook-url_BDC541B3: Refreshing state... [id=cdktn-provider-http:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktn-provider-http_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_14DDCE07: Refreshing state... [id=cdktn-provider-http:GO_GITHUB_TOKEN]
github_repository_webhook.cdktn-provider-http_repository-setup_slack-webhook_F059E3CA: Refreshing state... [id=591033492]
github_issue_label.cdktn-provider-dns-go_repository-setup_automerge-label_383D35E0: Refreshing state... [id=cdktn-provider-dns-go:automerge]
github_repository_webhook.cdktn-provider-dns-go_repository-setup_slack-webhook_81359FD7: Refreshing state... [id=591036173]
github_issue_label.cdktn-provider-dns-go_repository-setup_no-auto-close-label_98432EB1: Refreshing state... [id=cdktn-provider-dns-go:no-auto-close]
github_issue_label.cdktn-provider-dns-go_repository-setup_auto-approve-label_36B7CA1B: Refreshing state... [id=cdktn-provider-dns-go:auto-approve]
github_team_repository.cdktn-provider-dns-go_repository-setup_managing-team_D1AE7297: Refreshing state... [id=15746607:cdktn-provider-dns-go]
github_team_repository.cdktn-provider-dns_repository-setup_managing-team_663759C4: Refreshing state... [id=15746607:cdktn-provider-dns]
github_team_repository.cdktn-provider-http_repository-setup_managing-team_D727E80F: Refreshing state... [id=15746607:cdktn-provider-http]
github_team_repository.cdktn-provider-hcp_repository-setup_managing-team_B30BAFB6: Refreshing state... [id=15746607:cdktn-provider-hcp]
github_team_repository.cdktn-provider-hcp-go_repository-setup_managing-team_C8B8DF9F: Refreshing state... [id=15746607:cdktn-provider-hcp-go]
github_team_repository.cdktn-provider-http-go_repository-setup_managing-team_ABF10800: Refreshing state... [id=15746607:cdktn-provider-http-go]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_actions_secret.cdktn-provider-dns_repo_secret-alert-prs-slack-webhook-url_C4EC3CB5 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-dns_repo_secret-alert-prs-slack-webhook-url_C4EC3CB5" {
      ~ created_at       = "2026-01-11 15:11:33 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-dns:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:11:33 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-dns_repo_secret-gh-app-id-alias-PROJEN_APP_ID_C5FA55A4 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-dns_repo_secret-gh-app-id-alias-PROJEN_APP_ID_C5FA55A4" {
      ~ created_at       = "2026-01-11 15:11:34 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-dns:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:11:34 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-dns_repo_secret-gh-app-id_1792033E must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-dns_repo_secret-gh-app-id_1792033E" {
      ~ created_at       = "2026-01-11 15:12:06 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-dns:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:12:06 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-dns_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_3584BDE6 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-dns_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_3584BDE6" {
      ~ created_at       = "2026-01-11 15:11:37 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-dns:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:11:37 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-dns_repo_secret-gh-app-private-key_D6AE050F must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-dns_repo_secret-gh-app-private-key_D6AE050F" {
      ~ created_at       = "2026-01-11 15:11:42 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-dns:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:11:42 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-dns_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_9EC25F2C must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-dns_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_9EC25F2C" {
      ~ created_at       = "2026-02-18 05:16:06 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-dns:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:16:06 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-dns_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_E1562C5A must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-dns_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_E1562C5A" {
      ~ created_at       = "2026-02-18 05:16:09 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-dns:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:16:09 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-dns_repo_secret-gh-token_7730C1FC must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-dns_repo_secret-gh-token_7730C1FC" {
      ~ created_at       = "2026-02-18 05:16:13 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-dns:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:16:13 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-dns_repo_secret-npm-token_0DB44AAF must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-dns_repo_secret-npm-token_0DB44AAF" {
      ~ created_at       = "2026-02-08 02:42:41 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-dns:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-08 02:42:41 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-dns_repo_secret-twine-password_993A280C must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-dns_repo_secret-twine-password_993A280C" {
      ~ created_at       = "2026-02-02 17:59:48 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-dns:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-02 17:59:48 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-dns_repo_secret-twine-username_A225ECA9 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-dns_repo_secret-twine-username_A225ECA9" {
      ~ created_at       = "2026-01-11 15:11:36 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-dns:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:11:36 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-alert-prs-slack-webhook-url_CBDC2CE9 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-alert-prs-slack-webhook-url_CBDC2CE9" {
      ~ created_at       = "2026-02-19 04:04:22 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-hcp:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-02-19 04:04:22 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-gh-app-id-alias-PROJEN_APP_ID_E2AB9F33 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-gh-app-id-alias-PROJEN_APP_ID_E2AB9F33" {
      ~ created_at       = "2026-02-19 04:04:36 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-hcp:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-19 04:04:36 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-gh-app-id_48D8355E must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-gh-app-id_48D8355E" {
      ~ created_at       = "2026-02-19 04:04:46 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-hcp:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-19 04:04:46 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_09540776 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_09540776" {
      ~ created_at       = "2026-02-19 04:04:27 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-hcp:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-19 04:04:27 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-gh-app-private-key_280D74C1 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-gh-app-private-key_280D74C1" {
      ~ created_at       = "2026-02-19 04:04:40 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-hcp:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-19 04:04:40 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_5FE18D77 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_5FE18D77" {
      ~ created_at       = "2026-02-19 04:04:39 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-hcp:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 04:04:39 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_F60282E5 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_F60282E5" {
      ~ created_at       = "2026-02-19 04:04:44 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-hcp:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 04:04:44 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-gh-token_35D43952 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-gh-token_35D43952" {
      ~ created_at       = "2026-02-19 04:04:23 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-hcp:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 04:04:23 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-npm-token_457354E1 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-npm-token_457354E1" {
      ~ created_at       = "2026-02-19 04:04:21 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-hcp:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 04:04:21 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-twine-password_0C44EB37 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-twine-password_0C44EB37" {
      ~ created_at       = "2026-02-19 04:04:24 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-hcp:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-19 04:04:24 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-hcp_repo_secret-twine-username_4610D963 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-hcp_repo_secret-twine-username_4610D963" {
      ~ created_at       = "2026-02-19 04:04:28 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-hcp:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-02-19 04:04:28 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-http_repo_secret-alert-prs-slack-webhook-url_BDC541B3 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-http_repo_secret-alert-prs-slack-webhook-url_BDC541B3" {
      ~ created_at       = "2026-01-11 14:48:50 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-http:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-01-11 14:48:50 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-http_repo_secret-gh-app-id-alias-PROJEN_APP_ID_F8F3C7E3 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-http_repo_secret-gh-app-id-alias-PROJEN_APP_ID_F8F3C7E3" {
      ~ created_at       = "2026-01-11 14:48:43 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-http:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 14:48:43 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-http_repo_secret-gh-app-id_E8794717 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-http_repo_secret-gh-app-id_E8794717" {
      ~ created_at       = "2026-01-11 14:49:09 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-http:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 14:49:09 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-http_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_F0352969 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-http_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_F0352969" {
      ~ created_at       = "2026-01-11 14:49:04 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-http:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-11 14:49:04 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-http_repo_secret-gh-app-private-key_6F6E0F82 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-http_repo_secret-gh-app-private-key_6F6E0F82" {
      ~ created_at       = "2026-01-11 14:48:44 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-http:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-11 14:48:44 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-http_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_14DDCE07 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-http_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_14DDCE07" {
      ~ created_at       = "2026-02-18 05:16:07 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-http:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:16:07 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-http_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_080A2364 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-http_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_080A2364" {
      ~ created_at       = "2026-02-18 05:16:04 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-http:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:16:04 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-http_repo_secret-gh-token_B691F459 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-http_repo_secret-gh-token_B691F459" {
      ~ created_at       = "2026-02-18 05:16:11 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-http:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:16:11 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-http_repo_secret-npm-token_8061869F must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-http_repo_secret-npm-token_8061869F" {
      ~ created_at       = "2026-02-08 02:42:42 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-http:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-08 02:42:42 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-http_repo_secret-twine-password_D7E445AE must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-http_repo_secret-twine-password_D7E445AE" {
      ~ created_at       = "2026-02-02 17:59:52 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-http:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-02 17:59:52 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-http_repo_secret-twine-username_764E0074 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-http_repo_secret-twine-username_764E0074" {
      ~ created_at       = "2026-01-11 14:48:46 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-http:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-01-11 14:48:46 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 33 to add, 0 to change, 33 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @team-cdk-terrain[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*